songmeteor/arm_stm32/99.ELEVATOR/Core/Src/i2c_lcd.c
/*
 * i2c_lcd.c
 *
 *  Created on: 2019. 9. 4.
 *      Author: k
 */
#include "main.h"
#include "extern.h"
#include "stm32f4xx_hal.h"
#include <string.h>
#include <stdio.h>
#include "i2c_lcd.h"

extern I2C_HandleTypeDef hi2c1;

void i2c_lcd_main(void);
void i2c_lcd_init(void);
void lcd_string(uint8_t *str);
void move_cursor(uint8_t row, uint8_t column);
void i2c_lcd_dis_line0(void);
void i2c_lcd_dis_line1(void);

#define I2C_LCD_ADDRESS (0x27 << 1)
unsigned char lcd_test[4] = { '4','3', 0};


void i2c_lcd_dis_line0(void)
{
	static int value = 0;
	static int second = 0;
	char temp[10];

	if(line0_timer >= 100)
	{
		line0_timer = 0;
		move_cursor(0,0);
		sprintf(temp, "%d", second);
		lcd_string(temp);
		lcd_data(value + '0');
		value++;
		if(value>9)
		{
			second++;
			second %=60;
			value=0;
		}
	}
}

void i2c_lcd_dis_line1(void)
{
	static int value = 0;

	if(line1_timer >= 100)
	{
		line1_timer = 0;
		move_cursor(1,0);
		lcd_data(value + '0');
		value++;
		if(value>9)value=0;
	}
}


void i2c_lcd_main(void)
{
//  while (1)
//  {
//	   while(HAL_I2C_Master_Transmit(&hi2c1, I2C_LCD_ADDRESS,
//			 lcd_test, 2, 100)!=HAL_OK){
//		  //HAL_Delay(1);
//	   }
//	   HAL_Delay(1000);
//  }

#if 1
	uint8_t value=0;
	i2c_lcd_init();

	while(1)
	{
		move_cursor(0,0);
		lcd_string("Hello World!!!");
		move_cursor(1,0);
		lcd_data(value + '0');
		value++;
		if(value>9)value=0;
		HAL_Delay(500);
	}
#endif
}

void lcd_command(uint8_t command){

	uint8_t high_nibble, low_nibble;
	uint8_t i2c_buffer[4];
	high_nibble = command & 0xf0;
	low_nibble = (command<<4) & 0xf0;
	i2c_buffer[0] = high_nibble | 0x04 | 0x08; //en=1, rs=0, rw=0, backlight=1
	i2c_buffer[1] = high_nibble | 0x00 | 0x08; //en=0, rs=0, rw=0, backlight=1
	i2c_buffer[2] = low_nibble  | 0x04 | 0x08; //en=1, rs=0, rw=0, backlight=1
	i2c_buffer[3] = low_nibble  | 0x00 | 0x08; //en=0, rs=0, rw=0, backlight=1
	while(HAL_I2C_Master_Transmit(&hi2c1, I2C_LCD_ADDRESS,
			i2c_buffer, 4, 100)!=HAL_OK){
		//HAL_Delay(1);
	}

	for(int i=0; i<4; i++) // 8비트 4번 전송
	{

	}

	return;
}
void lcd_data(uint8_t data){

	uint8_t high_nibble, low_nibble;
	uint8_t i2c_buffer[4];
	high_nibble = data & 0xf0;
	low_nibble = (data<<4) & 0xf0;
	i2c_buffer[0] = high_nibble | 0x05 | 0x08; //en=1, rs=1, rw=0, backlight=1
	i2c_buffer[1] = high_nibble | 0x01 | 0x08; //en=0, rs=1, rw=0, backlight=1
	i2c_buffer[2] = low_nibble  | 0x05 | 0x08; //en=1, rs=1, rw=0, backlight=1
	i2c_buffer[3] = low_nibble  | 0x01 | 0x08; //en=0, rs=1, rw=0, backlight=1
	while(HAL_I2C_Master_Transmit(&hi2c1, I2C_LCD_ADDRESS,
			i2c_buffer, 4, 100)!=HAL_OK){
		//HAL_Delay(1);
	}
	return;
}
void i2c_lcd_init(void){

	lcd_command(0x33);
	lcd_command(0x32);
	lcd_command(0x28);	//Function Set 4-bit mode
	lcd_command(DISPLAY_ON);
	lcd_command(0x06);	//Entry mode set
	lcd_command(CLEAR_DISPLAY);
	HAL_Delay(2);
}
void lcd_string(uint8_t *str){
	while(*str)lcd_data(*str++);
}
void move_cursor(uint8_t row, uint8_t column){
	lcd_command(0x80 | row<<6 | column);
	return;
}











